models/LivroQuery.php

SELECT * FROM `livro`
---
    public function all($db = null)
    {
        return parent::all($db);